open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_bt_controller.c
/****************************************************************************
 * chips/bk7258/cp/
 * bk7258_bt_controller.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * CP-side bootstrap for the official Beken Bluetooth mailbox IPC.  The
 * controller itself is started on demand by the SDK vendor-init message sent
 * by the AP NuttX HCI wrapper.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#if defined(CONFIG_BK7258_BT_IPC) || defined(CONFIG_BK7258_WIFI_VNET)

#include <assert.h>
#include <errno.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <syslog.h>

#include <nuttx/mutex.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/spinlock.h>

#include <arch/chip/bk7258_bt_ipc.h>
#include <arch/chip/bk7258_flash.h>
#ifdef CONFIG_BK7258_RPTUN_MBOX
#  include <arch/chip/bk7258_rptun.h>
#endif
#include "bk7258_sdk_abi.h"

#include "bk7258_radio_storage.h"

#include <common/bk_err.h>
#include <components/system.h>

#ifdef CONFIG_BK7258_WIFI_VNET
#  include <components/event.h>
#  include <components/netif.h>
#  include <modules/wifi.h>

/* The public v3.1.1.9 wifi_types.h macro takes the addresses of these
 * archive-owned objects but the generated declarations were not exported in
 * the official armino_as_lib header bundle.  Only their addresses cross this
 * wrapper boundary, so their private structure definitions remain in SDK.
 */

extern void bk7258_os_wifi_malloc_zero_begin(void);
extern void bk7258_os_wifi_malloc_zero_end(void);
#endif

/****************************************************************************
 * External Function Prototypes
 ****************************************************************************/

/* CP and AP SDK variants intentionally expose different bt_ipc_init return
 * types.  This declaration matches the CP archive selected for this image.
 */

#ifdef CONFIG_BK7258_BT_IPC
extern void bk7258_os_bt_ipc_init_begin(void);
extern void bk7258_os_bt_ipc_init_end(void);

/* The immutable controller calls rand() from lld_adv_frm_isr for radio
 * scheduling jitter. NuttX rand() uses the interrupted task's TLS, which
 * does not exist for the idle task. Reuse libc's explicit-state PRNG in
 * interrupt context; task calls retain normal libc semantics. This is not
 * an entropy source: pairing/TLS continue to use the hardware TRNG path.
 */

extern int __real_rand(void);

int __wrap_rand(void)
{
  static unsigned int irq_seed = 1;
  irqstate_t flags;
  int value;

  if (!up_interrupt_context())
    {
      return __real_rand();
    }

  flags = enter_critical_section();
  value = rand_r(&irq_seed);
  leave_critical_section(flags);
  return value;
}
#endif

/* Restore every build-selected physical diagnostic owner after SDK leaves
 * that may touch pinmux.  SWD and UART are independent when their pins do
 * not conflict.
 */

#include <arch/chip/bk7258_console.h>

#ifdef CONFIG_BK7258_SWD_DEBUG
#  include <arch/chip/bk7258_debug.h>
#endif

static void bk7258_debug_transport_recover(void)
{
#ifdef CONFIG_BK7258_SWD_DEBUG
  (void)bk7258_swd_initialize();
#endif
#ifdef BK7258_HAVE_UART_CONSOLE
  bk7258_uart_recover_console();
#endif
}

/* Match the relevant ordering from the official CP startup sequence.  Driver
 * initialization makes flash calibration data readable.  The SDK
 * components_early_init installs the PHY/RF adapter tables, and the normal
 * Wi-Fi path subsequently initializes calibration.  The chip adapter
 * invokes none of those SDK top-level routines, so call their exported leaf
 * initializers explicitly before the Controller can open RF.
 */

/* WIFI_DEFAULT_INIT_CONFIG() normally publishes the SDK-owned callback table
 * through bk_wifi_init().  Bluetooth-only NuttX must not start the SDK Wi-Fi
 * stack, but the shared PHY backend still dereferences g_wifi_funcs for
 * critical-section leaves.
 */

/* The generated SDK bundle omits partitions_gen.h, so including the private
 * flash_partition.h is not possible.  Keep the small binary ABI used here
 * in the chip-private SDK ABI header and guard the numeric partition IDs
 * against the official v3.1.1.9 table at runtime before every read or write.
 */

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_SYS_CPU_POWER_SLEEP_WAKEUP    0x44010040u
#define BK7258_SYS_PWD_OFDM                  (1u << 13)

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_BK7258_BT_IPC
static mutex_t g_bk7258_bt_controller_lock = NXMUTEX_INITIALIZER;
static bool g_bk7258_bt_controller_ipc_ready;
static bool g_bk7258_bt_controller_ready;
#endif
#ifdef CONFIG_BK7258_WIFI_VNET
static mutex_t g_bk7258_wifi_controller_lock = NXMUTEX_INITIALIZER;
static bool g_bk7258_wifi_controller_ready;
#endif
static bool g_bk7258_bt_phy_adapter_ready;
static bool g_bk7258_bt_wifi_adapter_ready;
static bool g_bk7258_bt_calibration_ready;
static mutex_t g_bk7258_bt_mac_lock = NXMUTEX_INITIALIZER;
static bool g_bk7258_bt_mac_ready;
static uint8_t g_bk7258_bt_base_mac[BK_MAC_ADDR_LEN];
#ifdef CONFIG_BK7258_BT_IPC
static volatile uint32_t g_bk7258_bt_vendor_init_calls;
static volatile uint32_t g_bk7258_bt_vendor_deinit_calls;
static volatile int g_bk7258_bt_vendor_init_result;
static volatile int g_bk7258_bt_vendor_deinit_result;
volatile struct bk7258_bt_lifecycle_diag_s g_bk7258_bt_cp_lifecycle =
{
  .magic   = BK7258_BT_LIFECYCLE_MAGIC,
  .version = BK7258_BT_LIFECYCLE_VERSION,
  .size    = sizeof(struct bk7258_bt_lifecycle_diag_s),
  .state   = BK7258_BT_LIFECYCLE_CLOSED,
};
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

#if defined(CONFIG_BK7258_BT_IPC) && !defined(CONFIG_BK7258_WIFI_VNET)
static void bk7258_bt_set_ofdm_pwd(uint32_t value)
{
  volatile uint32_t *reg =
    (volatile uint32_t *)(uintptr_t)BK7258_SYS_CPU_POWER_SLEEP_WAKEUP;
  uint32_t current = *reg;

  if (value != 0)
    {
      current |= BK7258_SYS_PWD_OFDM;
    }
  else
    {
      current &= ~BK7258_SYS_PWD_OFDM;
    }

  *reg = current;
}

static uint32_t bk7258_bt_get_ofdm_pwd(void)
{
  volatile uint32_t *reg =
    (volatile uint32_t *)(uintptr_t)BK7258_SYS_CPU_POWER_SLEEP_WAKEUP;

  return (*reg & BK7258_SYS_PWD_OFDM) != 0;
}

