open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_bt_controller.c
static const struct bk7258_bt_wifi_phy_funcs_s g_bk7258_bt_wifi_phy_funcs =
{
  .cal_set_wifi_pll = rwnx_cal_set_rfconfig_WIFIPLL,
  .delay_us = bk_delay_us,
  .set_ofdm_pwd = bk7258_bt_set_ofdm_pwd,
  .get_ofdm_pwd = bk7258_bt_get_ofdm_pwd,
  .disable_int = rtos_disable_int,
  .enable_int = rtos_enable_int,
  .enter_low_analog = sys_hal_enter_low_analog,
  .exit_low_analog = sys_hal_exit_low_analog,
};
#endif

static_assert(BK_MAC_ADDR_LEN == BK7258_SDK_MAC_ADDRESS_SIZE,
              "Beken MAC address ABI changed");

/****************************************************************************
 * SDK Bluetooth Lifecycle Wrappers
 ****************************************************************************/

#ifdef CONFIG_BK7258_BT_IPC
int __wrap_bk_bluetooth_init(void)
{
  int ret;

  __atomic_fetch_add(&g_bk7258_bt_vendor_init_calls, 1u,
                     __ATOMIC_RELAXED);
  __atomic_fetch_add(&g_bk7258_bt_cp_lifecycle.init_requests, 1u,
                     __ATOMIC_RELAXED);
  ret = __real_bk_bluetooth_init();
  __atomic_store_n(&g_bk7258_bt_vendor_init_result, ret, __ATOMIC_RELEASE);
  __atomic_store_n(&g_bk7258_bt_cp_lifecycle.last_error, ret,
                   __ATOMIC_RELAXED);
  if (ret == 0)
    {
      __atomic_fetch_add(&g_bk7258_bt_cp_lifecycle.init_successes, 1u,
                         __ATOMIC_RELAXED);
      __atomic_store_n(&g_bk7258_bt_controller_ready, true,
                       __ATOMIC_RELEASE);
      __atomic_store_n(&g_bk7258_bt_cp_lifecycle.state,
                       BK7258_BT_LIFECYCLE_OPEN, __ATOMIC_RELEASE);
#ifdef CONFIG_BK7258_RPTUN_MBOX
      __atomic_fetch_or(&bk7258_rptun_control()->flags,
                        BK7258_RPTUN_FLAG_CP_BT_ACTIVE,
                        __ATOMIC_RELEASE);
#endif
    }

  bk7258_debug_transport_recover();

  if (ret != 0)
    {
      syslog(LOG_ERR, "bk7258: SDK Bluetooth init failed: %d\n", ret);
    }

  return ret;
}

int __wrap_bk_bluetooth_deinit(void)
{
  int ret;

  __atomic_fetch_add(&g_bk7258_bt_vendor_deinit_calls, 1u,
                     __ATOMIC_RELAXED);
  __atomic_fetch_add(&g_bk7258_bt_cp_lifecycle.deinit_requests, 1u,
                     __ATOMIC_RELAXED);
  ret = __real_bk_bluetooth_deinit();
  __atomic_store_n(&g_bk7258_bt_vendor_deinit_result, ret,
                   __ATOMIC_RELEASE);
  __atomic_store_n(&g_bk7258_bt_cp_lifecycle.last_error, ret,
                   __ATOMIC_RELAXED);
  if (ret == 0)
    {
      __atomic_fetch_add(&g_bk7258_bt_cp_lifecycle.deinit_successes, 1u,
                         __ATOMIC_RELAXED);
      __atomic_store_n(&g_bk7258_bt_controller_ready, false,
                       __ATOMIC_RELEASE);
      __atomic_store_n(&g_bk7258_bt_cp_lifecycle.state,
                       BK7258_BT_LIFECYCLE_CLOSED, __ATOMIC_RELEASE);
#ifdef CONFIG_BK7258_RPTUN_MBOX
      __atomic_fetch_and(&bk7258_rptun_control()->flags,
                         ~BK7258_RPTUN_FLAG_CP_BT_ACTIVE,
                         __ATOMIC_RELEASE);
#endif
    }

  bk7258_debug_transport_recover();

  if (ret != 0)
    {
      syslog(LOG_ERR, "bk7258: SDK Bluetooth deinit failed: %d\n", ret);
    }

  return ret;
}
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static bool bk7258_bt_mac_is_valid(const uint8_t *mac)
{
  bool all_zero = true;
  bool all_ff = true;
  unsigned int i;

  for (i = 0; i < BK_MAC_ADDR_LEN; i++)
    {
      all_zero = all_zero && mac[i] == 0;
      all_ff = all_ff && mac[i] == UINT8_MAX;
    }

  return !all_zero && !all_ff && (mac[0] & 1u) == 0;
}

static bool bk7258_bt_mac_is_official_valid(const uint8_t *mac)
{
  return bk7258_bt_mac_is_valid(mac) &&
         mac[0] == BK7258_SDK_MAC_OUI0 &&
         mac[1] == BK7258_SDK_MAC_OUI1 &&
         mac[2] == BK7258_SDK_MAC_OUI2;
}

static uint8_t bk7258_bt_crc8(const uint8_t *buffer, uint32_t length)
{
  uint8_t crc = 0;
  uint8_t bit;

  while (length-- > 0)
    {
      crc ^= *buffer++;
      for (bit = 0; bit < 8; bit++)
        {
          crc = (crc & 0x80u) != 0 ?
                (uint8_t)((crc << 1) ^ 0x31u) : (uint8_t)(crc << 1);
        }
    }

  return crc;
}

static bool bk7258_bt_partition_read(enum bk7258_radio_store_e store,
                                     uint32_t offset, uint8_t *buffer,
                                     uint32_t length)
{
  return bk7258_radio_storage_read(store, offset, buffer, length) == OK;
}

static bool bk7258_bt_partition_write(enum bk7258_radio_store_e store,
                                      uint32_t offset,
                                      const uint8_t *buffer,
                                      uint32_t length)
{
  return bk7258_radio_storage_write(store, offset, buffer, length) == OK;
}

static bool bk7258_bt_sysnet_write(const uint8_t *mac)
{
  return bk7258_bt_partition_write(BK7258_RADIO_STORE_NETWORK, 0, mac,
                                   BK_MAC_ADDR_LEN);
}

static bool bk7258_bt_mac_record_is_erased(
  const struct bk7258_bt_mac_record_s *record)
{
  const uint8_t *data = (const uint8_t *)record;
  unsigned int i;

  for (i = 0; i < sizeof(*record); i++)
    {
      if (data[i] != UINT8_MAX)
        {
          return false;
        }
    }

  return true;
}

static bool bk7258_bt_mac_record_is_valid(
  const struct bk7258_bt_mac_record_s *record)
{
  return record->magic == BK7258_SDK_MAC_RECORD_MAGIC &&
         bk7258_bt_crc8((const uint8_t *)record, 3) == record->header_crc &&
         bk7258_bt_crc8(record->mac, BK_MAC_ADDR_LEN) == record->data_crc &&
         bk7258_bt_mac_is_valid(record->mac);
}

static bool bk7258_bt_mac_read_backup(uint8_t *mac)
{
  union
  {
    uint8_t bytes[BK7258_SDK_MAC_RECORD_AREA_SIZE];
    struct bk7258_bt_mac_record_s records[BK7258_SDK_MAC_RECORD_COUNT];
  } area;

  const struct bk7258_bt_mac_record_s *records =
    area.records;
  int latest = BK7258_SDK_MAC_RECORD_COUNT - 1;
  int i;

  if (!bk7258_bt_partition_read(BK7258_RADIO_STORE_BACKUP,
                                BK7258_SDK_MAC_RECORD_AREA_OFFSET,
                                area.bytes, sizeof(area.bytes)))
    {
      return false;
    }

  for (i = 0; i < BK7258_SDK_MAC_RECORD_COUNT; i++)
    {
      if (bk7258_bt_mac_record_is_erased(&records[i]))
        {
          latest = i - 1;
          break;
        }
    }

  for (i = latest; i >= 0; i--)
    {
      if (bk7258_bt_mac_record_is_valid(&records[i]))
        {
          memcpy(mac, records[i].mac, BK_MAC_ADDR_LEN);
          return true;
        }
    }

