open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_bt_controller.c
  return false;
}

static bool bk7258_bt_mac_write_backup(const uint8_t *mac)
{
  union
  {
    uint8_t bytes[BK7258_SDK_MAC_RECORD_AREA_SIZE];
    struct bk7258_bt_mac_record_s records[BK7258_SDK_MAC_RECORD_COUNT];
  } area;

  struct bk7258_bt_mac_record_s record;
  int free_index = -1;
  int latest = -1;
  int i;

  if (!bk7258_bt_partition_read(BK7258_RADIO_STORE_BACKUP,
                                BK7258_SDK_MAC_RECORD_AREA_OFFSET,
                                area.bytes, sizeof(area.bytes)))
    {
      return false;
    }

  for (i = 0; i < BK7258_SDK_MAC_RECORD_COUNT; i++)
    {
      if (bk7258_bt_mac_record_is_erased(&area.records[i]))
        {
          free_index = i;
          break;
        }

      if (bk7258_bt_mac_record_is_valid(&area.records[i]))
        {
          latest = i;
        }
    }

  if (latest >= 0 &&
      memcmp(area.records[latest].mac, mac, BK_MAC_ADDR_LEN) == 0)
    {
      return true;
    }

  if (free_index < 0)
    {
      return false;
    }

  record.magic = BK7258_SDK_MAC_RECORD_MAGIC;
  memcpy(record.mac, mac, BK_MAC_ADDR_LEN);
  record.data_crc = bk7258_bt_crc8(record.mac, BK_MAC_ADDR_LEN);
  record.header_crc = bk7258_bt_crc8((const uint8_t *)&record, 3);

  return bk7258_bt_partition_write(
           BK7258_RADIO_STORE_BACKUP,
           BK7258_SDK_MAC_RECORD_AREA_OFFSET +
             (uint32_t)free_index * sizeof(record),
           (const uint8_t *)&record, sizeof(record));
}

static void bk7258_bt_mac_initialize_locked(void)
{
  static const uint8_t fallback[BK_MAC_ADDR_LEN] =
    {
      0xc8, 0x47, 0x8c, 0x00, 0x00, 0x18
    };

  uint8_t net_mac[BK_MAC_ADDR_LEN];
  uint8_t backup_mac[BK_MAC_ADDR_LEN];
  bool net_valid;
  bool backup_valid;
  bool net_written = true;
  bool backup_written = true;

  if (g_bk7258_bt_mac_ready)
    {
      return;
    }

  /* Match CONFIG_NEW_MAC_POLICY + CONFIG_RANDOM_MAC_ADDR from the official
   * CP profile.  sys_net is authoritative, the final 512 bytes of sys_rf are
   * an append-only CRC-checked backup, and an empty board receives the Beken
   * OUI plus three TRNG bytes.  The chip storage service owns all operations;
   * the board contributes only the generated SYS_RF/SYS_NET topology because
   * libbk_system.a owns an incompatible FreeRTOS runtime and is not linked.
   */

  memset(net_mac, UINT8_MAX, sizeof(net_mac));
  memset(backup_mac, UINT8_MAX, sizeof(backup_mac));

  if (bk7258_flash_initialize() < 0)
    {
      memcpy(g_bk7258_bt_base_mac, fallback, sizeof(fallback));
      g_bk7258_bt_mac_ready = true;
      return;
    }

  net_valid = bk7258_bt_partition_read(
                BK7258_RADIO_STORE_NETWORK, 0, net_mac,
                sizeof(net_mac)) &&
              bk7258_bt_mac_is_official_valid(net_mac);
  backup_valid = bk7258_bt_mac_read_backup(backup_mac) &&
                 bk7258_bt_mac_is_official_valid(backup_mac);

  if (net_valid)
    {
      memcpy(g_bk7258_bt_base_mac, net_mac, sizeof(net_mac));
      if (!backup_valid ||
          memcmp(net_mac, backup_mac, sizeof(net_mac)) != 0)
        {
          backup_written = bk7258_bt_mac_write_backup(net_mac);
        }
    }
  else if (backup_valid)
    {
      memcpy(g_bk7258_bt_base_mac, backup_mac, sizeof(backup_mac));
      net_written = bk7258_bt_sysnet_write(backup_mac);
    }
  else if (bk_trng_driver_init() == BK_OK)
    {
      g_bk7258_bt_base_mac[0] = BK7258_SDK_MAC_OUI0;
      g_bk7258_bt_base_mac[1] = BK7258_SDK_MAC_OUI1;
      g_bk7258_bt_base_mac[2] = BK7258_SDK_MAC_OUI2;
      g_bk7258_bt_base_mac[3] = (uint8_t)bk_rand();
      g_bk7258_bt_base_mac[4] = (uint8_t)bk_rand();
      g_bk7258_bt_base_mac[5] = (uint8_t)bk_rand();
      net_written = bk7258_bt_sysnet_write(g_bk7258_bt_base_mac);
      backup_written =
        bk7258_bt_mac_write_backup(g_bk7258_bt_base_mac);
    }
  else
    {
      memcpy(g_bk7258_bt_base_mac, fallback, sizeof(fallback));
      net_written = false;
      backup_written = false;
    }

  if (!net_written || !backup_written)
    {
      syslog(LOG_WARNING,
             "bk7258: base MAC persistence incomplete: net=%u backup=%u\n",
             net_written, backup_written);
    }

  g_bk7258_bt_mac_ready = true;
}

/****************************************************************************
 * SDK System-service Wrappers
 ****************************************************************************/

/* libbk_system.a contains the FreeRTOS tick/printf runtime and must not be
 * linked into NuttX.  Provide the small MAC service required by the real
 * Beken controller, preserving the SDK's interface-address mapping.
 */

bk_err_t bk_get_mac(uint8_t *mac, mac_type_t type)
{
  uint8_t mac_mask = 1u; /* Official NX_VIRT_DEV_MAX is 2. */
  uint8_t mac_low;
  int ret;

  if (mac == NULL)
    {
      return BK_ERR_NULL_PARAM;
    }

  ret = nxmutex_lock(&g_bk7258_bt_mac_lock);
  if (ret < 0)
    {
      return BK_FAIL;
    }

  bk7258_bt_mac_initialize_locked();
  memcpy(mac, g_bk7258_bt_base_mac, BK_MAC_ADDR_LEN);

  switch (type)
    {
      case MAC_TYPE_BASE:
      case MAC_TYPE_STA:
        break;

      case MAC_TYPE_AP:
        mac_low = mac[5];
        mac[5] &= ~mac_mask;
        mac_low = (mac_low & mac_mask) ^ mac_mask;
        mac[5] |= mac_low;
        break;

      case MAC_TYPE_BLUETOOTH:
        mac[5]++;
        break;

      case MAC_TYPE_ETH:
        mac[5] += 3;
        break;

      default:
        nxmutex_unlock(&g_bk7258_bt_mac_lock);
        return BK_ERR_INVALID_MAC_TYPE;
    }

  nxmutex_unlock(&g_bk7258_bt_mac_lock);
  return BK_OK;
}

bk_err_t bk_set_base_mac(const uint8_t *mac)
{
  bool backup_written;
  bool net_written;
  int ret;

  if (mac == NULL)
    {
      return BK_ERR_NULL_PARAM;
    }

  if (!bk7258_bt_mac_is_valid(mac))
    {
      return BK_ERR_GROUP_MAC;
    }

  ret = nxmutex_lock(&g_bk7258_bt_mac_lock);
  if (ret < 0)
    {
      return BK_FAIL;
    }

  bk7258_bt_mac_initialize_locked();
  net_written = bk7258_bt_sysnet_write(mac);
  backup_written = bk7258_bt_mac_write_backup(mac);

  /* sys_net is authoritative on the next boot.  Publish the new in-memory
   * address only after that write succeeds; a backup-only partial write is
   * repaired from the still-authoritative sys_net record on the next read.
   */

  if (net_written)
    {
      memcpy(g_bk7258_bt_base_mac, mac, BK_MAC_ADDR_LEN);
    }

  nxmutex_unlock(&g_bk7258_bt_mac_lock);
  return net_written && backup_written ? BK_OK : BK_FAIL;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

#ifdef CONFIG_BK7258_WIFI_VNET
int bk7258_wifi_controller_initialize(void)
{
  wifi_init_config_t config = WIFI_DEFAULT_INIT_CONFIG();
  bk_err_t sdkret;
  int ret;

  ret = nxmutex_lock(&g_bk7258_wifi_controller_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (g_bk7258_wifi_controller_ready)
    {
      nxmutex_unlock(&g_bk7258_wifi_controller_lock);
      return OK;
    }

  /* Follow the official v3.1.1.9 CP startup leaves, but keep NuttX in
   * charge of startup, scheduling and interrupts.  bk_wifi_init() installs
   * the complete SDK callback table; the Bluetooth-only reduced callback
   * table below must never replace it in a Wi-Fi build.
   */

