open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_bt_controller.c
  if (bk7258_flash_initialize() < 0 || bk_adc_driver_init() != BK_OK)
    {
      ret = -EIO;
      goto out;
    }

  if (!g_bk7258_bt_phy_adapter_ready)
    {
      bk_phy_adapter_init();
      bk_rf_adapter_init();
      g_bk7258_bt_phy_adapter_ready = true;
    }

  sdkret = bk_event_init();
  if (sdkret != BK_OK)
    {
      ret = -EIO;
      goto recover_console;
    }

  sdkret = bk_netif_init();
  if (sdkret != BK_OK)
    {
      ret = -EIO;
      goto recover_console;
    }

  bk7258_os_wifi_malloc_zero_begin();
  sdkret = bk_wifi_init(&config);
  bk7258_os_wifi_malloc_zero_end();
  if (sdkret != BK_OK)
    {
      ret = -EIO;
      goto recover_console;
    }

  g_bk7258_bt_wifi_adapter_ready = true;
  g_bk7258_bt_calibration_ready = true;
  __atomic_store_n(&g_bk7258_wifi_controller_ready, true,
                   __ATOMIC_RELEASE);
  ret = OK;

recover_console:
  bk7258_debug_transport_recover();
out:
  nxmutex_unlock(&g_bk7258_wifi_controller_lock);
  return ret;
}

bool bk7258_wifi_controller_active(void)
{
  return __atomic_load_n(&g_bk7258_wifi_controller_ready,
                         __ATOMIC_ACQUIRE);
}
#endif

#ifdef CONFIG_BK7258_BT_IPC
int bk7258_bt_controller_ipc_initialize(void)
{
  int32_t sdkret;
  int ret;

#ifdef CONFIG_BK7258_WIFI_VNET
  /* Wi-Fi owns the complete shared RF callback table and must be ready before
   * Bluetooth controller IPC starts.  This also makes the combined profile's
   * initialization order independent of the AP boot timing.
   */

  ret = bk7258_wifi_controller_initialize();
  if (ret < 0)
    {
      return ret;
    }
#endif

  ret = nxmutex_lock(&g_bk7258_bt_controller_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (g_bk7258_bt_controller_ipc_ready)
    {
      nxmutex_unlock(&g_bk7258_bt_controller_lock);
      return OK;
    }

  /* Match the relevant driver_init() leaves used by the official CP startup.
   * Calibration reads sys_rf through the SDK flash driver and owns SARADC
   * through the SDK ADC mutex/buffer.  Both drivers must therefore precede
   * bk_cal_if_init(); waiting until bk_get_mac() is too late because the
   * controller asks for its MAC only after RF/calibration startup.
   */

#ifndef CONFIG_BK7258_WIFI_VNET
  if (bk7258_flash_initialize() < 0)
    {
      nxmutex_unlock(&g_bk7258_bt_controller_lock);
      return -EIO;
    }

  if (bk_adc_driver_init() != BK_OK)
    {
      nxmutex_unlock(&g_bk7258_bt_controller_lock);
      return -EIO;
    }

  if (!g_bk7258_bt_phy_adapter_ready)
    {
      bk_phy_adapter_init();
      bk_rf_adapter_init();
      g_bk7258_bt_phy_adapter_ready = true;
    }

  if (!g_bk7258_bt_wifi_adapter_ready)
    {
      g_wifi_funcs = (void *)&g_bk7258_bt_wifi_phy_funcs;
      __asm volatile ("dmb sy" ::: "memory");
      g_bk7258_bt_wifi_adapter_ready = true;
    }

  if (!g_bk7258_bt_calibration_ready)
    {
      /* Match the official CP driver_init() call site, which deliberately
       * ignores this function's return value.  In SDK v3.1.1.9 the normal
       * calibration_init() zero return is translated by bk_cal_if_init() to
       * -1 even though calibration has completed; treating it as bk_err_t
       * aborts before Bluetooth IPC is initialized.
       */

      (void)bk_cal_if_init();
      g_bk7258_bt_calibration_ready = true;
    }
#endif

  bk7258_os_bt_ipc_init_begin();
  sdkret = bt_ipc_init();
  bk7258_os_bt_ipc_init_end();

  /* The official CP startup performs the PHY/RF/calibration leaf sequence
   * before it hands the UART to the application.  In the NuttX wrapper the
   * console may already be live, and that same sequence can clear UART
   * registers without using bk_uart_deinit().  Reassert selected debug and
   * console ownership only after every SDK leaf above has completed.
   */

  bk7258_debug_transport_recover();
  if (sdkret == 0 || sdkret == 1)
    {
      g_bk7258_bt_controller_ipc_ready = true;
      ret = OK;
    }
  else
    {
      ret = -EIO;
    }

  nxmutex_unlock(&g_bk7258_bt_controller_lock);
  return ret;
}

int bk7258_bt_controller_initialize(void)
{
  int sdkret;
  int ret;

  ret = nxmutex_lock(&g_bk7258_bt_controller_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (__atomic_load_n(&g_bk7258_bt_controller_ready, __ATOMIC_ACQUIRE))
    {
      ret = OK;
      goto out;
    }

  if (!g_bk7258_bt_controller_ipc_ready)
    {
      ret = -EAGAIN;
      goto out;
    }

  /* This is the official v3.1.1.9 controller startup, delayed only until
   * the AP has published that its SDK BT mailbox endpoint is ready.  The AP
   * still issues the normal vendor-init request afterwards; the SDK handles
   * that second call idempotently and returns through its original ABI.
   */

  sdkret = __wrap_bk_bluetooth_init();
  if (sdkret != 0)
    {
      ret = -EIO;
      goto out;
    }

  __atomic_store_n(&g_bk7258_bt_controller_ready, true,
                   __ATOMIC_RELEASE);
  ret = OK;

out:
  nxmutex_unlock(&g_bk7258_bt_controller_lock);
  return ret;
}
#endif

#endif /* CONFIG_BK7258_BT_IPC || CONFIG_BK7258_WIFI_VNET */
